aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    func_mset_s_ccp_setup();        /* CCP機能設定 */
    func_mset_s_timer2_setup();     /* シフト用サーボ 00 ※CCP機能へ割り当て中 */
    func_mset_s_timer4_setup();     /* シフト用サーボ 01 ※CCP機能へ割り当て中 */
    func_mset_s_timer6_setup();     /* シフト用サーボ 02 ※CCP機能へ割り当て中 */
}




/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer0_setup( void )
{
    /* タイマ0の個別設定は実質、OPTION_REG の設定で実行される */

    /* タイマレジスタ初期化 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR0 = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                     */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /*===================================================================*/
                            /*  +------------------------- 7 : CPSON     */
                            /*  | +----------------------- 6 : -         */
                            /*  | | +--------------------- 5 : -         */
                            /*  | | | +------------------- 4 : -         */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CPSRNG<1> */
                            /*  | | | |     | +----------- 2 : CPSRNG<0> */
                            /*  | | | |     | | +--------- 1 : CPSOUT    */
                            /*  | | | |     | | | + ------ 0 : T0XCS     */
    //CPSCON0 = 0xFFU;        /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* タイマ0の入力に外部クロック使わんのなら、上記の設定は意味なし          */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  CCPモジュール設定                                           */
/*  Capture/Compare/PWM 機能設定につかう                        */
/**************************************************************/
static void func_mset_s_ccp_setup( void )
{
    /* CCPモジュール 動作モード選択 */
    /* タイマの附番と連動してないので、確認しずらい・・・ */
    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP4CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP3CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP2CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    CCP1CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* CCPモジュールへのタイマ割り当て設定 */
    /*===================================================================*/
                            /*  +------------------------- 7 : C4TSEL<1> */  /* CCP4:未割当て */
                            /*  | +----------------------- 6 : C4TSEL<0> */
                            /*  | | +--------------------- 5 : C3TSEL<1> */  /* CCP3:Timer6 */
                            /*  | | | +------------------- 4 : C3TSEL<0> */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : C2TSEL<1> */  /* CCP2:Timer4 */
                            /*  | | | |     | +----------- 2 : C2TSEL<0> */
                            /*  | | | |     | | +--------- 1 : C1TSEL<1> */  /* CCP1:Timer2 */
                            /*  | | | |     | | | + ------ 0 : C1TSEL<0> */
    CCPTMRS = 0xE4U;        /*  1 1 1 0  -  0 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 00:Timer2                                                         */
    /* 01:Timer4                                                         */
    /* 10:Timer6                                                         */
    /* 11:未割当                                                          */
    /*===================================================================*/


    /* PWM キャリア周期設定 */
    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* PWM duty比 設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    //CCPR3L = 0x00;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/
    
